# FamilyLoadedIntoDocumentEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyLoadedIntoDocumentEventArgs Class
Members See Also
---
The event arguments used by the FamilyLoadedInto event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class FamilyLoadedIntoDocumentEventArgs : RevitAPIPostDocEventArgs
```

Visual Basic
---
```text
Public Class FamilyLoadedIntoDocumentEventArgs _
	Inherits RevitAPIPostDocEventArgs
```

Visual C++
---
```text
public ref class FamilyLoadedIntoDocumentEventArgs : public RevitAPIPostDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostDocEventArgs Autodesk.Revit.DB.Events..::..FamilyLoadedIntoDocumentEventArgs
# See Also
FamilyLoadedIntoDocumentEventArgs Members
Autodesk.Revit.DB.Events Namespace